// напишите программу, которая на вход принимает два числа и проверяет является ли первое число квадраом второго
Console.WriteLine("введите первое число");
int numa = int.Parse(Console.ReadLine());
Console.WriteLine("введите второе число");
int numb = int.Parse(Console.ReadLine());
int numasqr = numa*numb;
if(numasqr  == numb)
{
    Console.WriteLine("Квадрат перврго числа равен второму числу");
}
    else 
{    Console.WriteLine("Квадрат перврго числа равен второму числу");
}



