// напишите программу, которая на вход принимает два числа и проверяет является ли первое число квадраом второго
Console.WriteLine("День недели");
int day = int.Parse(Console.ReadLine());
switch(day)
{
    case(1):
Console.Write ("понедельник");
break;
case(2):
Console.Write ("вторник");
break;
case(3):
Console.Write ("среда");
break;
case(4):
Console.Write ("четверг");
break;
case(5):
Console.Write ("пятница");
break;
case(6):
Console.Write ("суббота");
break;
case(7):
Console.Write ("суббота");
break;
default:
Console.Write ("такого дня не существует на планете Земля");
break;
}